# HostRailingId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRail..::..HostRailingId Property
ContinuousRail Class See Also
---
The id of the host Railing that contains this rail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId HostRailingId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HostRailingId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ HostRailingId {
	ElementId^ get ();
}
```

# See Also
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace